In [327]:
import pandas as pd

In [328]:
data = pd.read_csv('stations.csv')

In [329]:
features = pd.DataFrame()

In [330]:
features['name'] = data['STN_NAME']

In [331]:
features['code'] = data['STN_NO']

In [332]:
features.head()

                         name  code
0           EUNOS MRT STATION   EW7
1  CHINESE GARDEN MRT STATION  EW25
2          KHATIB MRT STATION  NS14
3          KRANJI MRT STATION   NS7
4         REDHILL MRT STATION  EW18

In [333]:
features.shape

(171, 2)

In [334]:
rows_list = features.values
new_rows = []
for row in rows_list:
    codes = row[1].split('/')
    if len(codes) > 1:
        print(codes)
        row[1] = codes[0]
        for i in range(1, len(codes)):
            new_rows.append([row[0], codes[i]])

['EW8', 'CC9']
['EW2', 'DT32']
['CG1', 'DT35']
['EW24', 'NS1']
['NS9', 'TE2']
['EW21', 'CC22']
['CC10', 'DT26']
['EW13', 'NS25']
['NE1', 'CC29']
['EW12', 'DT14']
['NS22', 'TE14']
['DT16', 'CE1']
['CC17', 'TE9']
['NS27', 'TE20', 'CE2']
['NE4', 'DT19']
['NS24', 'NE6', 'CC1']
['NE12', 'CC13']
['NS17', 'CC15']
['NE7', 'DT12']
['DT10', 'TE11']
['CC4', 'DT15']
['CC19', 'DT9']
['EW14', 'NS26']
['NS21', 'DT11']

In [335]:
new_rows

[['PAYA LEBAR MRT STATION', 'CC9'],
 ['TAMPINES MRT STATION', 'DT32'],
 ['EXPO MRT STATION', 'DT35'],
 ['JURONG EAST MRT STATION', 'NS1'],
 ['WOODLANDS MRT STATION', 'TE2'],
 ['BUONA VISTA MRT STATION', 'CC22'],
 ['MACPHERSON MRT STATION', 'DT26'],
 ['CITY HALL MRT STATION', 'NS25'],
 ['HARBOURFRONT MRT STATION', 'CC29'],
 ['BUGIS MRT STATION', 'DT14'],
 ['ORCHARD MRT STATION', 'TE14'],
 ['BAYFRONT MRT STATION', 'CE1'],
 ['CALDECOTT MRT STATION', 'TE9'],
 ['MARINA BAY MRT STATION', 'TE20'],
 ['MARINA BAY MRT STATION', 'CE2'],
 ['CHINATOWN MRT STATION', 'DT19'],
 ['DHOBY GHAUT MRT STATION', 'NE6'],
 ['DHOBY GHAUT MRT STATION', 'CC1'],
 ['SERANGOON MRT STATION', 'CC13'],
 ['BISHAN MRT STATION', 'CC15'],
 ['LITTLE INDIA MRT STATION', 'DT12'],
 ['STEVENS MRT STATION', 'TE11'],
 ['PROMENADE MRT STATION', 'DT15'],
 ['BOTANIC GARDENS MRT STATION', 'DT9'],
 ['RAFFLES PLACE MRT STATION', 'NS26'],
 ['NEWTON MRT STATION', 'DT11']]

In [336]:
rows = rows_list.tolist()
for row in new_rows:
    rows.append(row)

In [337]:
df = pd.DataFrame(rows)

In [338]:
len(new_rows)

26

In [339]:
df.shape

(197, 2)

In [340]:
df['line'] = None

In [341]:
df['num'] = None

In [342]:
import re

In [343]:
pattern_digits = "[0-9]+"
pattern_capital = "[A-Z]+"

In [344]:
def extract_digits(code):
    result = re.findall(pattern_digits, code)
    if len(result) == 0:
        print("Problem: ", code)
        return None
    return result[0]

In [345]:
def extract_letters(code):
    result = re.findall(pattern_capital, code)
    return result[0]

In [346]:
df.head()

                            0     1  line   num
0           EUNOS MRT STATION   EW7  None  None
1  CHINESE GARDEN MRT STATION  EW25  None  None
2          KHATIB MRT STATION  NS14  None  None
3          KRANJI MRT STATION   NS7  None  None
4         REDHILL MRT STATION  EW18  None  None

In [347]:
df.rename(columns={0: 'name', 1: 'code'}, inplace=True)

In [348]:
df.head()

                         name  code  line   num
0           EUNOS MRT STATION   EW7  None  None
1  CHINESE GARDEN MRT STATION  EW25  None  None
2          KHATIB MRT STATION  NS14  None  None
3          KRANJI MRT STATION   NS7  None  None
4         REDHILL MRT STATION  EW18  None  None

In [349]:
df['line'] = df.apply(lambda x: extract_letters(x.code), axis=1)

In [350]:
df.head()

                         name  code line   num
0           EUNOS MRT STATION   EW7   EW  None
1  CHINESE GARDEN MRT STATION  EW25   EW  None
2          KHATIB MRT STATION  NS14   NS  None
3          KRANJI MRT STATION   NS7   NS  None
4         REDHILL MRT STATION  EW18   EW  None

In [351]:
df['num'] = df.apply(lambda x: extract_digits(x.code), axis=1)

Problem:  PTC
Problem:  STC

In [352]:
df.head()

                         name  code line num
0           EUNOS MRT STATION   EW7   EW   7
1  CHINESE GARDEN MRT STATION  EW25   EW  25
2          KHATIB MRT STATION  NS14   NS  14
3          KRANJI MRT STATION   NS7   NS   7
4         REDHILL MRT STATION  EW18   EW  18

In [353]:
df.shape

(197, 4)

In [354]:
df = df.dropna()

In [355]:
temp = df[df['line']=='BP']

In [356]:
temp.shape

(13, 4)

In [357]:
for row in temp.values:
    print(row)

['BUKIT PANJANG LRT STATION' 'BP6' 'BP' '6']
['FAJAR LRT STATION' 'BP10' 'BP' '10']
['KEAT HONG LRT STATION' 'BP3' 'BP' '3']
['SENJA LRT STATION' 'BP13' 'BP' '13']
['JELAPANG LRT STATION' 'BP12' 'BP' '12']
['PETIR LRT STATION' 'BP7' 'BP' '7']
['TECK WHYE LRT STATION' 'BP4' 'BP' '4']
['CHOA CHU KANG LRT STATION' 'BP1' 'BP' '1']
['SOUTH VIEW LRT STATION' 'BP2' 'BP' '2']
['PENDING LRT STATION' 'BP8' 'BP' '8']
['BANGKIT LRT STATION' 'BP9' 'BP' '9']
['PHOENIX LRT STATION' 'BP5' 'BP' '5']
['SEGAR LRT STATION' 'BP11' 'BP' '11']

In [358]:
df = df[df.line != 'BP']

In [359]:
df.shape

(182, 4)

In [360]:
class Station:
    def __init__(self, name, code, line, num):
        self.name = name
        self.code = code
        self.line = line 
        self.num = num 
        self.edges = [] 

    def display(self):
        print(self.code, self.name, self.edges)

In [361]:
metro = {}

In [362]:
for row in df.values:
    s = Station(row[0], row[1], row[2], row[3])
    metro[row[1]] = s

In [363]:
df['num'] = pd.to_numeric(df['num'], downcast='integer')

In [364]:
df[df.isna().any(axis=1)]

Empty DataFrame
Columns: [name, code, line, num]
Index: []

In [365]:
df = df.sort_values(['line', 'num'], ascending=[True, True])

In [366]:
for row in df.values:
    if row[2] == 'CC':
        print(row)

['DHOBY GHAUT MRT STATION' 'CC1' 'CC' 1]
['BRAS BASAH MRT STATION' 'CC2' 'CC' 2]
['ESPLANADE MRT STATION' 'CC3' 'CC' 3]
['PROMENADE MRT STATION' 'CC4' 'CC' 4]
['NICOLL HIGHWAY MRT STATION' 'CC5' 'CC' 5]
['STADIUM MRT STATION' 'CC6' 'CC' 6]
['MOUNTBATTEN MRT STATION' 'CC7' 'CC' 7]
['DAKOTA MRT STATION' 'CC8' 'CC' 8]
['PAYA LEBAR MRT STATION' 'CC9' 'CC' 9]
['MACPHERSON MRT STATION' 'CC10' 'CC' 10]
['TAI SENG MRT STATION' 'CC11' 'CC' 11]
['BARTLEY MRT STATION' 'CC12' 'CC' 12]
['SERANGOON MRT STATION' 'CC13' 'CC' 13]
['LORONG CHUAN MRT STATION' 'CC14' 'CC' 14]
['BISHAN MRT STATION' 'CC15' 'CC' 15]
['MARYMOUNT MRT STATION' 'CC16' 'CC' 16]
['CALDECOTT MRT STATION' 'CC17' 'CC' 17]
['BUKIT BROWN MRT STATION' 'CC18' 'CC' 18]
['BOTANIC GARDENS MRT STATION' 'CC19' 'CC' 19]
['FARRER ROAD MRT STATION' 'CC20' 'CC' 20]
['HOLLAND VILLAGE MRT STATION' 'CC21' 'CC' 21]
['BUONA VISTA MRT STATION' 'CC22' 'CC' 22]
['ONE-NORTH MRT STATION' 'CC23' 'CC' 23]
['KENT RIDGE MRT STATION' 'CC24' 'CC' 24]
['HAW PAR VILLA MRT STATION' 'CC25' 'CC' 25]
['PASIR PANJANG MRT STATION' 'CC26' 'CC' 26]
['LABRADOR PARK MRT STATION' 'CC27' 'CC' 27]
['TELOK BLANGAH MRT STATION' 'CC28' 'CC' 28]
['HARBOURFRONT MRT STATION' 'CC29' 'CC' 29]

In [367]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 182 entries, 188 to 184
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    182 non-null    object
 1   code    182 non-null    object
 2   line    182 non-null    object
 3   num     182 non-null    int8
dtypes: int8(1), object(3)
memory usage: 5.9+ KB

In [368]:
row_list = df.values
for i in range(len(row_list)-1):
    current = row_list[i]
    next_row = row_list[i+1]
    if current[2] == next_row[2]:
        if next_row[3] - current[3] == 1:
            metro[current[1]].edges.append(next_row[1])
            metro[next_row[1]].edges.append(current[1])

In [369]:
metro['DT11'].display()

DT11 NEWTON MRT STATION ['DT10', 'DT12']

In [370]:
df = df.sort_values(['name'], ascending=[True])

In [371]:
df.head()

                       name  code line  num
11    ADMIRALTY MRT STATION  NS10   NS   10
15     ALJUNIED MRT STATION   EW9   EW    9
16   ANG MO KIO MRT STATION  NS16   NS   16
75        BAKAU LRT STATION   SE3   SE    3
130     BARTLEY MRT STATION  CC12   CC   12

In [375]:
processed = [] 
for row in df.values:
    duplicates = df[df.name == row[0]]
    if len(duplicates) > 1 and row[0] not in processed:
        processed.append(row[0])
        rows = duplicates.values
        for i in range(len(duplicates)):
            for j in range(i+1, len(duplicates)):
                metro[rows[i][1]].edges.append(rows[j][1])
                metro[rows[j][1]].edges.append(rows[i][1])

In [376]:
metro['CC1'].display()

CC1 DHOBY GHAUT MRT STATION ['CC2', 'NS24', 'NE6']

In [377]:
metro['NS24'].display()

NS24 DHOBY GHAUT MRT STATION ['NS23', 'NS25', 'NE6', 'CC1']

In [378]:
metro['NE6'].display()

NE6 DHOBY GHAUT MRT STATION ['NE5', 'NE7', 'NS24', 'CC1']

In [379]:
df.to_csv('processed_stations.csv', index=False)